<template>
    <div class="navbar__back">
        <div class="container mx-auto px-4 xl:px-12 md:px-12">
            <div class="flex justify-between py-2 relative">
                <div class="flex navbar__text ">
                    <a href="#" class="flex">
                        <img src="../../assets/svg/location.svg" alt="">
                        <span class="">Москва</span>
                    </a>
                    <a class="ml-4" href="#">Бесплатная доставка</a>
                </div>
                <div class="flex navbar__text">
                    <a href="#">
                        Продавайте на LogoName
                    </a>
                    <a class="ml-4 navbar__category" href="#">Ру</a>
                </div>
            </div>
            <div class="grid grid-cols-7 gap-4 mt-0 xl:mt-3 md:mt-3">
                <div class="col-span-2 flex navbar__category">
                    <div class="navbar__logo">
                        <a href="/"><img class="navbar__logo" src="../../assets/image/logo.png" alt=""></a>
                    </div>
                    <div class="category__button ml-12">
                        <button @click="categoryToggle" class="flex items-center">
                            <img v-if="!category" class="mr-3" src="../../assets/svg/menu.svg" alt="">
                            <i v-else class="fas fa-times mr-3"></i>
                            <span>Категории</span>
                            <img class="ml-3" src="../../assets/svg/dropdown.svg" alt="">
                        </button>
                    </div>
                </div>
                <div class="col-span-3">
                    <div class="relative search__input">
                        <input @click="closeCategory" type="search" v-model="searchweb" class="py-2 w-full text-sm text-white rounded-md pl-4 pr-12 text-gray-900" placeholder="Я ищу" autocomplete="off">
                        <transition name="fade">
                            <search-web v-if="searchweb.length > 2" />
                        </transition>
                        <span class="absolute inset-y-0 right-0 flex items-center pr-2">
                            <button type="submit" class="p-1 focus:shadow-outline">
                                <img src="../../assets/svg/search.svg" alt="">
                            </button>
                        </span>
                    </div>
                </div>
                <div class="col-span-2">
                    <div class="flex navbar__icons">
                        <router-link to="/delivery" tag="a" class="flex flex-col justify-between">
                            <img class="h-6 flex flex-row items-center" src="../../assets/svg/delivery.svg" alt="">
                            <span>Доставка</span>
                        </router-link>
                        <router-link to="/selected" tag="a" class="flex flex-col justify-between">
                            <span class="count__navbar1">2</span>
                            <img class="h-5 flex flex-row items-center" src="../../assets/svg/saved.svg" alt="">
                            <span>Избранные</span>
                        </router-link>
                        <router-link tag="a" to="/basket" class="flex flex-col justify-between">
                            <span class="count__navbar2">2</span>
                            <img class="h-7 flex flex-row items-center" src="../../assets/svg/cart.svg" alt="">
                            <span>Корзина</span>
                        </router-link>
                        <router-link @click.native="$router.go()" tag="a" to="/info"  class="flex flex-col justify-between navbar__category">
                            <li class="flex flex-col justify-between navbar__category" @mouseover="listOne = true" @mouseleave="listOne = false">
                                <img class="h-5 flex flex-row items-center" src="../../assets/svg/user.svg" alt="">
                                <span class="margin__hover">Войти</span>
                                <transition name="fade">
                                    <div v-if="listOne" @mouseleave="listOne = false" @click="listOne = false" class="profile__dropdown">
                                        <a  href="#" class="profile__header">
                                            <div class="profile__image">
                                                <img src="../../assets/image/carbon_user-avatar-filled-alt.png" alt="">
                                            </div>
                                            <div class="profile__title">
                                                <h5>Mironshoh Nasimov</h5>
                                            </div>
                                        </a>
                                        <div class="profile__bottom">
                                            <ul class="profile__ul">
                                                <li class="profile__item">
                                                    <router-link to="/basket" tag="a" >
                                                        <i class="fas fa-chevron-right"></i>
                                                        Мои заказы
                                                    </router-link>
                                                </li>
                                                <li class="profile__item">
                                                    <router-link tag="a" to="/payments">
                                                        <i class="fas fa-chevron-right"></i>
                                                        Мои платежи
                                                    </router-link>
                                                </li>
                                                <li class="profile__item">
                                                    <router-link tag="a" to="/message">
                                                        <i class="fas fa-chevron-right"></i>
                                                        Мои сообщения
                                                    </router-link>
                                                </li>
                                                <li class="profile__item">
                                                    <router-link tag="a" to="/selected">
                                                        <i class="fas fa-chevron-right"></i>
                                                        Избранные товара
                                                    </router-link>
                                                </li>
                                                <li class="profile__item">
                                                    <router-link tag="a" to="/info">
                                                        <i class="fas fa-chevron-right"></i>
                                                        Мои данные
                                                    </router-link>
                                                </li>
                                                <li class="profile__item">
                                                    <a href="#">
                                                        <i class="fas fa-chevron-right"></i>
                                                        Выйти
                                                    </a>
                                                </li>
                                            </ul>
                                        </div>
                                    </div>
                                </transition>
                            </li>
                        </router-link>
                    </div>
                </div>
            </div>
            <div class="menu__mobile">
                <div class="menu__logo">
                    <a href="/"><img class="h-8 my-3" src="../../assets/image/logo.png" alt=""></a>
                </div>
                <div class="navbar__menu">
                    <router-link tag="a" to="/basket">
                        <svg width="28px" height="28px" fill="#111" viewBox="0 0 24 24">
                            <path d="M16 7a1 1 0 0 1-1-1V3H9v3a1 1 0 0 1-2 0V3a2 2 0 0 1 2-2h6a2 2 0 0 1 2 2v3a1 1 0 0 1-1 1z"></path>
                            <path d="M20 5H4a2 2 0 0 0-2 2v13a3 3 0 0 0 3 3h14a3 3 0 0 0 3-3V7a2 2 0 0 0-2-2zm0 15a1 1 0 0 1-1 1H5a1 1 0 0 1-1-1V7h16z"></path>
                        </svg>
                    </router-link>
                    <svg @click="showSearch" class="pre-search-input-icon" fill="#111" height="30px" width="30px" viewBox="0 0 24 24">
                        <path d="M21.71 20.29L18 16.61A9 9 0 1 0 16.61 18l3.68 3.68a1 1 0 0 0 1.42 0 1 1 0 0 0 0-1.39zM11 18a7 7 0 1 1 7-7 7 7 0 0 1-7 7z"></path>
                    </svg>
                    <div class="menu__responsive">
                        <Menu :closeOnNavigation="true" right>
                        <div class="responsive__logo mb-4">
                            <img class="h-6 mx-auto" src="../../assets/image/logo.png" alt="">
                        </div>
                        <div class="user__name">Mironshoh Nasimov</div>
                        <div class="profile__title pb-1 pt-4">Профиль</div>
                        <div class="my__profile ml-2">
                            <svg width="22" height="22" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M11.9993 0.666504C13.5022 0.666504 14.9436 1.26353 16.0063 2.32623C17.069 3.38894 17.666 4.83028 17.666 6.33317C17.666 7.83606 17.069 9.2774 16.0063 10.3401C14.9436 11.4028 13.5022 11.9998 11.9993 11.9998C10.4965 11.9998 9.05512 11.4028 7.99241 10.3401C6.9297 9.2774 6.33268 7.83606 6.33268 6.33317C6.33268 4.83028 6.9297 3.38894 7.99241 2.32623C9.05512 1.26353 10.4965 0.666504 11.9993 0.666504ZM11.9993 14.8332C18.261 14.8332 23.3327 17.369 23.3327 20.4998V23.3332H0.666016V20.4998C0.666016 17.369 5.73768 14.8332 11.9993 14.8332Z" fill="white"/>
                            </svg>
                            <div class="profile__text">Мой профиль</div>
                            <svg class="arrow-right" width="9" height="13" viewBox="0 0 9 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M2.41602 0.25L0.947266 1.71875L5.7181 6.5L0.947266 11.2812L2.41602 12.75L8.66602 6.5L2.41602 0.25Z" fill="white"/>
                            </svg>
                        </div>
                        <div class="profile__title pb-1 pt-4">Мои товары</div>
                        <div class="goods ml-2">
                            <svg width="22" height="22" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M26.666 10.6665H5.33268V7.99984H26.666V10.6665ZM23.9994 2.6665H7.99935V5.33317H23.9994V2.6665ZM29.3327 15.9998V26.6665C29.3327 27.3738 29.0517 28.052 28.5516 28.5521C28.0515 29.0522 27.3733 29.3332 26.666 29.3332H5.33268C4.62609 29.3311 3.94904 29.0494 3.4494 28.5498C2.94976 28.0502 2.66813 27.3731 2.66602 26.6665V15.9998C2.66813 15.2932 2.94976 14.6162 3.4494 14.1166C3.94904 13.6169 4.62609 13.3353 5.33268 13.3332H26.666C27.3726 13.3353 28.0497 13.6169 28.5493 14.1166C29.049 14.6162 29.3306 15.2932 29.3327 15.9998ZM18.5687 22.7225L21.666 20.0745L17.5874 19.7332L15.9994 15.9998L14.4114 19.7332L10.3327 20.0745L13.43 22.7225L12.4967 26.6665L15.9994 24.5705L19.502 26.6665L18.5687 22.7225Z" fill="white"/>
                            </svg>
                            <div class="goods__title">Карточки товаров</div>
                        </div>
                        <div class="goods ml-2">
                            <svg width="22" height="22" viewBox="0 0 27 31" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M25.0508 12.1999H26.7008V30.3499H0.300781V12.1999H1.95078V8.89991C1.95078 4.34591 5.64678 0.64991 10.2008 0.64991C11.3723 0.64991 12.4943 0.89741 13.5008 1.34291C14.5405 0.884419 15.6645 0.648369 16.8008 0.64991C21.3548 0.64991 25.0508 4.34591 25.0508 8.89991V12.1999ZM5.25078 8.89991V12.1999H8.55078V8.89991C8.55078 7.03541 9.19428 5.33591 10.2338 3.94991H10.2008C7.47828 3.94991 5.25078 6.17741 5.25078 8.89991ZM21.7508 12.1999V8.89991C21.7508 6.17741 19.5233 3.94991 16.8008 3.94991H16.7678C17.8527 5.37267 18.4437 7.11068 18.4508 8.89991V12.1999H21.7508ZM13.5008 5.23691C12.4943 6.14441 11.8508 7.44791 11.8508 8.89991V12.1999H15.1508V8.89991C15.1508 7.44791 14.5073 6.14441 13.5008 5.23691Z" fill="white"/>
                            </svg>
                            <div class="goods__title">Товары</div>
                            <svg class="arrow-right" width="9" height="13" viewBox="0 0 9 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M2.41602 0.25L0.947266 1.71875L5.7181 6.5L0.947266 11.2812L2.41602 12.75L8.66602 6.5L2.41602 0.25Z" fill="white"/>
                            </svg>
                        </div>
                        <div class="goods ml-2">
                            <svg width="22" height="22" viewBox="0 0 32 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M24.3833 1.7335C23.7833 0.883496 22.7833 0.333496 21.6667 0.333496H3.33333C1.5 0.333496 0 1.8335 0 3.66683V20.3335C0 21.2176 0.351189 22.0654 0.976311 22.6905C1.60143 23.3156 2.44928 23.6668 3.33333 23.6668H21.6667C22.7833 23.6668 23.7833 23.1002 24.3833 22.2502L31.6667 12.0002L24.3833 1.7335ZM9.08333 5.3835C10.3833 5.3835 11.45 6.45016 11.45 7.75016C11.45 9.05016 10.3833 10.1168 9.08333 10.1168C7.78333 10.1168 6.71667 9.05016 6.71667 7.75016C6.71667 6.45016 7.78333 5.3835 9.08333 5.3835ZM17.5833 18.6168C16.2833 18.6168 15.2167 17.5502 15.2167 16.2502C15.2167 14.9502 16.2833 13.8835 17.5833 13.8835C18.8833 13.8835 19.95 14.9502 19.95 16.2502C19.95 17.5502 18.8833 18.6168 17.5833 18.6168ZM8.66667 18.6668L6.66667 16.6668L18 5.3335L20 7.3335L8.66667 18.6668Z" fill="white"/>
                            </svg>
                            <div class="goods__title">Цены и скидкы</div>
                            <svg class="arrow-right" width="9" height="13" viewBox="0 0 9 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M2.41602 0.25L0.947266 1.71875L5.7181 6.5L0.947266 11.2812L2.41602 12.75L8.66602 6.5L2.41602 0.25Z" fill="white"/>
                            </svg>
                        </div>
                        <div class="goods ml-2">
                            <svg width="22" height="22" viewBox="0 0 29 29" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M21.9993 17.9998H5.99935L0.666016 23.3332V1.99984C0.666016 1.64622 0.806491 1.30708 1.05654 1.05703C1.30659 0.80698 1.64573 0.666504 1.99935 0.666504H21.9993C22.353 0.666504 22.6921 0.80698 22.9422 1.05703C23.1922 1.30708 23.3327 1.64622 23.3327 1.99984V16.6665C23.3327 17.0201 23.1922 17.3593 22.9422 17.6093C22.6921 17.8594 22.353 17.9998 21.9993 17.9998ZM28.666 9.99984V28.6665L23.3327 23.3332H8.66602C8.31239 23.3332 7.97326 23.1927 7.72321 22.9426C7.47316 22.6926 7.33268 22.3535 7.33268 21.9998V20.6665H25.9993V8.6665H27.3327C27.6863 8.6665 28.0254 8.80698 28.2755 9.05703C28.5255 9.30708 28.666 9.64622 28.666 9.99984ZM8.91935 3.33317C7.75935 3.33317 6.82602 3.59984 6.10602 4.11984C5.41268 4.6665 5.06602 5.4265 5.07935 6.47984L5.09268 6.51984H7.66602C7.67935 6.11984 7.79935 5.81317 8.03935 5.59984C8.28625 5.3951 8.59868 5.28622 8.91935 5.29317C9.33268 5.29317 9.67935 5.4265 9.91935 5.6665C10.1593 5.91984 10.266 6.2665 10.266 6.6665C10.266 7.09317 10.1727 7.45317 9.95935 7.75984C9.77268 8.0665 9.49268 8.33317 9.14602 8.5465C8.46602 8.99984 7.99935 9.39984 7.74602 9.75984C7.47935 10.1065 7.33268 10.6665 7.33268 11.3332H9.99935C9.99935 10.9198 10.0527 10.5865 10.1727 10.3465C10.2927 10.1065 10.5194 9.8665 10.8527 9.65317C11.4527 9.33317 11.946 8.9465 12.3327 8.41317C12.7193 7.87984 12.9193 7.33317 12.9193 6.6665C12.9193 5.65317 12.5593 4.83984 11.8393 4.23984C11.1327 3.63984 10.1593 3.33317 8.91935 3.33317ZM7.33268 12.6665V15.3332H9.99935V12.6665H7.33268ZM15.3327 15.3332H17.9993V12.6665H15.3327V15.3332ZM15.3327 3.33317V11.3332H17.9993V3.33317H15.3327Z" fill="white"/>
                            </svg>
                            <div class="goods__title">Отзывы и вопросы</div>
                            <svg class="arrow-right" width="9" height="13" viewBox="0 0 9 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M2.41602 0.25L0.947266 1.71875L5.7181 6.5L0.947266 11.2812L2.41602 12.75L8.66602 6.5L2.41602 0.25Z" fill="white"/>
                            </svg>
                        </div>
                        <div class="goods ml-2">
                            <svg width="22" height="22" viewBox="0 0 30 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M27.444 0.444336H2.55512C2.08363 0.444336 1.63144 0.631637 1.29804 0.965035C0.964645 1.29843 0.777344 1.75062 0.777344 2.22211V21.7777C0.777344 22.2492 0.964645 22.7013 1.29804 23.0347C1.63144 23.3681 2.08363 23.5554 2.55512 23.5554H27.444C27.9155 23.5554 28.3677 23.3681 28.7011 23.0347C29.0345 22.7013 29.2218 22.2492 29.2218 21.7777V2.22211C29.2218 1.75062 29.0345 1.29843 28.7011 0.965035C28.3677 0.631637 27.9155 0.444336 27.444 0.444336ZM19.0529 19.0577L12.7418 9.65322L7.10623 17.9021L3.10623 14.3466L4.3329 12.9332L6.7329 15.0577L12.7418 6.27545L19.1329 15.7954L25.3551 7.55545L26.8662 8.69322L19.0529 19.0577Z" fill="white"/>
                            </svg>
                            <div class="goods__text">Аналитика</div>
                        </div>
                        <div class="profile__title pb-1 pt-4">Управление поставками</div>
                        <div class="management ml-2">
                            <svg width="22" height="22" viewBox="0 0 30 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M27.5062 14.7128L29.9684 4.55659C30.1461 3.82329 29.5516 3.125 28.7495 3.125H8.29208L7.81469 0.937012C7.69573 0.39165 7.18385 0 6.59005 0H1.25C0.559635 0 0 0.524658 0 1.17188V1.95312C0 2.60034 0.559635 3.125 1.25 3.125H4.88974L8.54849 19.8943C7.67318 20.3662 7.08333 21.2511 7.08333 22.2656C7.08333 23.7758 8.38917 25 10 25C11.6108 25 12.9167 23.7758 12.9167 22.2656C12.9167 21.5003 12.5809 20.8088 12.0404 20.3125H22.9595C22.4191 20.8088 22.0833 21.5003 22.0833 22.2656C22.0833 23.7758 23.3892 25 25 25C26.6108 25 27.9167 23.7758 27.9167 22.2656C27.9167 21.183 27.2454 20.2475 26.2719 19.8044L26.5593 18.6191C26.737 17.8858 26.1425 17.1875 25.3404 17.1875H11.3603L11.0194 15.625H26.2873C26.871 15.625 27.3769 15.2464 27.5062 14.7128Z" fill="white"/>
                            </svg>
                            <div class="management__text">Продажи со склада продавца</div>
                            <svg class="arrow-right" width="9" height="13" viewBox="0 0 9 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M2.41602 0.25L0.947266 1.71875L5.7181 6.5L0.947266 11.2812L2.41602 12.75L8.66602 6.5L2.41602 0.25Z" fill="white"/>
                            </svg>
                        </div>
                        <div class="management ml-2">
                            <svg width="22" height="22" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M27.9375 0.9375H2.0625C1.44023 0.9375 0.9375 1.44023 0.9375 2.0625V27.9375C0.9375 28.5598 1.44023 29.0625 2.0625 29.0625H27.9375C28.5598 29.0625 29.0625 28.5598 29.0625 27.9375V2.0625C29.0625 1.44023 28.5598 0.9375 27.9375 0.9375ZM10.3594 21.4688C9.58242 21.4688 8.95312 20.8395 8.95312 20.0625C8.95312 19.2855 9.58242 18.6562 10.3594 18.6562C11.1363 18.6562 11.7656 19.2855 11.7656 20.0625C11.7656 20.8395 11.1363 21.4688 10.3594 21.4688ZM10.3594 16.4062C9.58242 16.4062 8.95312 15.777 8.95312 15C8.95312 14.223 9.58242 13.5938 10.3594 13.5938C11.1363 13.5938 11.7656 14.223 11.7656 15C11.7656 15.777 11.1363 16.4062 10.3594 16.4062ZM10.3594 11.3438C9.58242 11.3438 8.95312 10.7145 8.95312 9.9375C8.95312 9.16055 9.58242 8.53125 10.3594 8.53125C11.1363 8.53125 11.7656 9.16055 11.7656 9.9375C11.7656 10.7145 11.1363 11.3438 10.3594 11.3438ZM21.0469 20.9062C21.0469 21.0609 20.9203 21.1875 20.7656 21.1875H14.2969C14.1422 21.1875 14.0156 21.0609 14.0156 20.9062V19.2188C14.0156 19.0641 14.1422 18.9375 14.2969 18.9375H20.7656C20.9203 18.9375 21.0469 19.0641 21.0469 19.2188V20.9062ZM21.0469 15.8438C21.0469 15.9984 20.9203 16.125 20.7656 16.125H14.2969C14.1422 16.125 14.0156 15.9984 14.0156 15.8438V14.1562C14.0156 14.0016 14.1422 13.875 14.2969 13.875H20.7656C20.9203 13.875 21.0469 14.0016 21.0469 14.1562V15.8438ZM21.0469 10.7812C21.0469 10.9359 20.9203 11.0625 20.7656 11.0625H14.2969C14.1422 11.0625 14.0156 10.9359 14.0156 10.7812V9.09375C14.0156 8.93906 14.1422 8.8125 14.2969 8.8125H20.7656C20.9203 8.8125 21.0469 8.93906 21.0469 9.09375V10.7812Z" fill="white"/>
                            </svg>
                            <div class="management__text">Комиссия, логистика и хранение</div>
                        </div>
                        <div class="profile__title pb-1 pt-4">Финансы и документы</div>
                        <div class="document ml-2">
                            <svg width="22" height="22" viewBox="0 0 23 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M0.666016 2.8C0.666016 2.05739 0.929408 1.3452 1.39825 0.820101C1.86709 0.294999 2.50297 0 3.16602 0L16.8443 0L22.3327 6.14693V25.2C22.3327 25.9426 22.0693 26.6548 21.6004 27.1799C21.1316 27.705 20.4957 28 19.8327 28H3.16602C2.50297 28 1.86709 27.705 1.39825 27.1799C0.929408 26.6548 0.666016 25.9426 0.666016 25.2V2.8ZM5.66602 7.46667H10.666V9.33333H5.66602V7.46667ZM17.3327 13.0667H5.66602V14.9333H17.3327V13.0667ZM17.3327 18.6667H12.3327V20.5333H17.3327V18.6667Z" fill="white"/>
                            </svg>
                            <div class="document__text">Отчеты</div>
                        </div>
                        <div class="document ml-2">
                            <svg width="22" height="22" viewBox="0 0 24 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M15.8902 0H1.83025C1.33512 0.013107 0.865174 0.221075 0.522515 0.578714C0.179855 0.936353 -0.00782685 1.41477 0.000250311 1.91V26.09C-0.00782685 26.5852 0.179855 27.0636 0.522515 27.4213C0.865174 27.7789 1.33512 27.9869 1.83025 28H22.1702C22.6654 27.9869 23.1353 27.7789 23.478 27.4213C23.8206 27.0636 24.0083 26.5852 24.0002 26.09V7.92L15.8902 0ZM15.0002 9V1.84L22.3002 9H15.0002Z" fill="white"/>
                            </svg>
                            <div class="document__text">Документы</div>
                        </div>
                        <div class="profile__title pb-1 pt-4">Информация</div>
                        <div class="information ml-2">
                            <svg width="22" height="22" viewBox="0 0 28 29" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M26.4213 4.84193C26.4107 4.83109 24.2732 7.00267 20.0193 11.3675L17.0346 8.29984L23.3943 1.76341C20.0475 -0.306994 15.7479 0.224157 12.96 3.08949C11.8943 4.18416 11.1274 5.54757 10.7362 7.04299C10.345 8.53841 10.3432 10.1133 10.7311 11.6096L10.7943 11.8517L0.827539 22.0917C0.60957 22.3158 0.60957 22.6843 0.827539 22.9083L5.79863 28.0175C6.0166 28.2415 6.3752 28.2415 6.59316 28.0175L16.5529 17.7811L16.7885 17.8461C19.7311 18.6519 22.8916 17.8136 25.0854 15.5589C27.8768 12.6936 28.3936 8.27455 26.4213 4.84193Z" fill="white"/>
                            </svg>
                            <div class="information__text">Поддержка</div>
                        </div>
                        <div class="information ml-2">
                            <svg width="22" height="22" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M15 30C12.9688 30 11.0254 29.6045 9.16992 28.8135C7.31445 28.0225 5.71777 26.958 4.37988 25.6201C3.04199 24.2822 1.97754 22.6855 1.18652 20.8301C0.395508 18.9746 0 17.0312 0 15C0 12.9688 0.395508 11.0254 1.18652 9.16992C1.97754 7.31445 3.04199 5.71777 4.37988 4.37988C5.71777 3.04199 7.31445 1.97754 9.16992 1.18652C11.0254 0.395508 12.9688 0 15 0C17.0312 0 18.9746 0.395508 20.8301 1.18652C22.6855 1.97754 24.2822 3.04199 25.6201 4.37988C26.958 5.71777 28.0225 7.31445 28.8135 9.16992C29.6045 11.0254 30 12.9688 30 15C30 17.0312 29.6045 18.9746 28.8135 20.8301C28.0225 22.6855 26.958 24.2822 25.6201 25.6201C24.2822 26.958 22.6855 28.0225 20.8301 28.8135C18.9746 29.6045 17.0312 30 15 30ZM15.0146 26.25C15.5322 26.25 15.9717 26.0693 16.333 25.708C16.6943 25.3467 16.875 24.9072 16.875 24.3896C16.875 23.8721 16.6943 23.4277 16.333 23.0566C15.9717 22.6855 15.5322 22.5 15.0146 22.5C14.4971 22.5 14.0527 22.6855 13.6816 23.0566C13.3105 23.4277 13.125 23.8721 13.125 24.3896C13.125 24.9072 13.3105 25.3467 13.6816 25.708C14.0527 26.0693 14.4971 26.25 15.0146 26.25ZM15 3.75C12.9297 3.75 11.1621 4.48242 9.69727 5.94727C8.23242 7.41211 7.5 9.17969 7.5 11.25C7.5 11.7773 7.68066 12.2217 8.04199 12.583C8.40332 12.9443 8.84277 13.125 9.36035 13.125C9.87793 13.125 10.3223 12.9443 10.6934 12.583C11.0645 12.2217 11.25 11.7773 11.25 11.25C11.25 10.2148 11.6162 9.33105 12.3486 8.59863C13.0811 7.86621 13.9648 7.5 15 7.5C16.0352 7.5 16.9189 7.86621 17.6514 8.59863C18.3838 9.33105 18.75 10.2148 18.75 11.25C18.75 12.2852 18.3838 13.1689 17.6514 13.9014C16.9189 14.6338 16.0352 15 15 15C14.4922 15 14.0527 15.3857 13.6816 16.1572C13.3105 16.9287 13.125 17.793 13.125 18.75C13.125 19.2773 13.3057 19.7217 13.667 20.083C14.0283 20.4443 14.4727 20.625 15 20.625C15.5273 20.625 15.9717 20.4443 16.333 20.083C16.6943 19.7217 16.875 19.2773 16.875 18.75V18.5156C18.5156 18.0859 19.8633 17.1973 20.918 15.8496C21.9727 14.502 22.5 12.9688 22.5 11.25C22.5 9.17969 21.7676 7.41211 20.3027 5.94727C18.8379 4.48242 17.0703 3.75 15 3.75Z" fill="white"/>
                            </svg>
                            <div class="information__text">Инструкции</div>
                        </div>
                        <div class="information ml-2">
                            <svg width="22" height="22" viewBox="0 0 31 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M22.4264 0.833496C23.2579 0.833394 24.0583 1.14893 24.6661 1.71633C25.2738 2.28373 25.6435 3.06068 25.7004 3.89016L25.7077 4.11475V20.521C25.7073 20.7032 25.7752 20.8789 25.898 21.0136C26.0208 21.1482 26.1895 21.2321 26.371 21.2485C26.5524 21.265 26.7335 21.2129 26.8785 21.1026C27.0235 20.9922 27.1219 20.8315 27.1544 20.6522L27.166 20.521V5.22891C27.9272 5.31402 28.6346 5.66271 29.1657 6.21458C29.6968 6.76644 30.0181 7.48671 30.0739 8.25058L30.0827 8.48975V19.4272C30.0828 20.6379 29.6196 21.8026 28.7882 22.6826C27.9567 23.5625 26.8201 24.091 25.6114 24.1595L25.3431 24.1668H5.6556C4.44498 24.1669 3.28022 23.7037 2.40026 22.8723C1.5203 22.0409 0.991847 20.9043 0.923307 19.6956L0.916016 19.4272V4.11475C0.915914 3.28331 1.23145 2.48284 1.79885 1.87511C2.36625 1.26737 3.1432 0.897695 3.97268 0.840788L4.19727 0.833496H22.4264ZM11.486 11.0418H6.38185C6.09177 11.0418 5.81357 11.1571 5.60845 11.3622C5.40333 11.5673 5.2881 11.8455 5.2881 12.1356V17.2397C5.2881 17.8435 5.7781 18.3335 6.38185 18.3335H11.486C11.7761 18.3335 12.0543 18.2183 12.2594 18.0131C12.4645 17.808 12.5798 17.5298 12.5798 17.2397V12.1356C12.5798 11.8455 12.4645 11.5673 12.2594 11.3622C12.0543 11.1571 11.7761 11.0418 11.486 11.0418ZM20.2418 16.146H16.5989L16.4502 16.1562C16.1757 16.194 15.9257 16.3345 15.7508 16.5495C15.5759 16.7645 15.4892 17.0378 15.5081 17.3143C15.5269 17.5908 15.6501 17.8498 15.8526 18.039C16.0551 18.2281 16.3218 18.3334 16.5989 18.3335H20.2418L20.3906 18.3233C20.6651 18.2855 20.9151 18.1449 21.09 17.93C21.2648 17.715 21.3516 17.4417 21.3327 17.1652C21.3138 16.8887 21.1907 16.6297 20.9882 16.4405C20.7857 16.2514 20.519 16.1461 20.2418 16.146ZM10.3923 13.2293V16.146H7.4756V13.2293H10.3923ZM20.2389 11.0418L16.596 11.0491L16.4473 11.0579C16.1701 11.093 15.9168 11.2328 15.7395 11.4487C15.5621 11.6646 15.4741 11.9402 15.4935 12.2189C15.5129 12.4977 15.6382 12.7584 15.8438 12.9476C16.0494 13.1369 16.3195 13.2403 16.5989 13.2366L20.2433 13.2293L20.3906 13.2191C20.6653 13.1813 20.9153 13.0406 21.0902 12.8255C21.2651 12.6104 21.3518 12.3369 21.3327 12.0603C21.3136 11.7837 21.1902 11.5247 20.9874 11.3356C20.7846 11.1466 20.5176 11.0415 20.2404 11.0418H20.2389ZM20.2404 5.9435H6.38185L6.2331 5.9537C5.95857 5.99148 5.70861 6.13205 5.53373 6.34702C5.35885 6.56199 5.27209 6.83532 5.29098 7.11179C5.30987 7.38827 5.433 7.64727 5.63549 7.83645C5.83798 8.02564 6.10473 8.13091 6.38185 8.131H20.2418L20.3906 8.12225C20.6675 8.08713 20.9205 7.94748 21.0978 7.73191C21.275 7.51634 21.3632 7.24115 21.3442 6.96269C21.3252 6.68423 21.2004 6.42358 20.9955 6.2341C20.7906 6.04462 20.5209 5.94066 20.2418 5.9435H20.2404Z" fill="white"/>
                            </svg>
                            <div class="information__text">Новости</div>
                        </div>
                        <div class="information ml-2">
                            <svg width="22" height="22" viewBox="0 0 29 29" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M1.20898 1.2085V13.2918H27.7923V1.2085H1.20898ZM15.709 8.4585H4.83398V6.04183H15.709V8.4585ZM19.334 8.4585C19.095 8.4585 18.8614 8.38763 18.6627 8.25486C18.464 8.12208 18.3091 7.93337 18.2176 7.71257C18.1262 7.49178 18.1022 7.24882 18.1489 7.01443C18.1955 6.78004 18.3106 6.56473 18.4796 6.39574C18.6486 6.22675 18.8639 6.11167 19.0982 6.06505C19.3326 6.01842 19.5756 6.04235 19.7964 6.13381C20.0172 6.22526 20.2059 6.38014 20.3387 6.57885C20.4715 6.77756 20.5423 7.01118 20.5423 7.25016C20.5423 7.57063 20.415 7.87798 20.1884 8.10458C19.9618 8.33119 19.6545 8.4585 19.334 8.4585ZM22.959 8.4585C22.72 8.4585 22.4864 8.38763 22.2877 8.25486C22.089 8.12208 21.9341 7.93337 21.8426 7.71257C21.7512 7.49178 21.7272 7.24882 21.7739 7.01443C21.8205 6.78004 21.9356 6.56473 22.1046 6.39574C22.2736 6.22675 22.4889 6.11167 22.7232 6.06505C22.9576 6.01842 23.2006 6.04235 23.4214 6.13381C23.6422 6.22526 23.8309 6.38014 23.9637 6.57885C24.0964 6.77756 24.1673 7.01118 24.1673 7.25016C24.1673 7.57063 24.04 7.87798 23.8134 8.10458C23.5868 8.33119 23.2795 8.4585 22.959 8.4585Z" fill="white"/>
                                <path d="M27.4161 22.1969L28.7936 20.9886L27.5853 18.8982L25.8332 19.4903C25.4452 19.1633 25.0038 18.9057 24.5282 18.729L24.1657 16.9165H21.749L21.3865 18.7169C20.9109 18.8936 20.4694 19.1512 20.0815 19.4782L18.3294 18.8861L17.1211 20.9765L18.4986 22.1848C18.4019 22.6877 18.4019 23.2044 18.4986 23.7073L17.1211 24.9157L18.3294 27.0061L20.0815 26.414C20.4694 26.741 20.9109 26.9986 21.3865 27.1753L21.749 28.9998H24.1657L24.5282 27.1994C25.0038 27.0227 25.4453 26.7652 25.8332 26.4382L27.5853 27.0303L28.7936 24.9398L27.4161 23.7315C27.5128 23.2245 27.5128 22.7039 27.4161 22.1969ZM22.9573 25.3748C22.4794 25.3748 22.0121 25.2331 21.6147 24.9676C21.2173 24.702 20.9075 24.3246 20.7246 23.883C20.5417 23.4414 20.4939 22.9555 20.5871 22.4867C20.6804 22.0179 20.9105 21.5873 21.2485 21.2493C21.5865 20.9114 22.0171 20.6812 22.4859 20.5879C22.9547 20.4947 23.4406 20.5425 23.8822 20.7255C24.3238 20.9084 24.7012 21.2181 24.9667 21.6155C25.2323 22.013 25.374 22.4802 25.374 22.9582C25.3721 23.5985 25.1169 24.2121 24.6641 24.6649C24.2113 25.1177 23.5977 25.3729 22.9573 25.3748Z" fill="white"/>
                                <path d="M14.5007 22.9585H4.83398V20.5418H14.8559C15.4631 18.5176 16.8052 16.7936 18.6187 15.7085H1.20898V27.7918H16.0232C15.0309 26.3755 14.4993 24.6878 14.5007 22.9585Z" fill="white"/>
                            </svg>
                            <div class="information__text">Оферты</div>
                        </div>
                        <div class="information ml-2">
                            <svg width="22" height="22" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M22.75 26H11.375C10.4779 26 9.71191 25.6829 9.07715 25.0488C8.44238 24.4146 8.125 23.6494 8.125 22.7532V21.1298C8.125 20.6732 8.28158 20.2885 8.59473 19.9756C8.90788 19.6628 9.28874 19.5063 9.7373 19.5063C10.1859 19.5063 10.571 19.6628 10.8926 19.9756C11.2142 20.2885 11.375 20.6689 11.375 21.1171C11.375 21.5652 11.5316 21.9499 11.8447 22.2712C12.1579 22.5925 12.543 22.7532 13 22.7532H19.5C19.9401 22.7532 20.321 22.5925 20.6426 22.2712C20.9642 21.9499 21.125 21.5694 21.125 21.1298V4.87024C21.125 4.43057 20.9642 4.05008 20.6426 3.72878C20.321 3.40748 19.9401 3.24683 19.5 3.24683H13C12.543 3.24683 12.1579 3.40748 11.8447 3.72878C11.5316 4.05008 11.375 4.4348 11.375 4.88293C11.375 5.33106 11.2142 5.71577 10.8926 6.03707C10.571 6.35837 10.1859 6.51902 9.7373 6.51902C9.28874 6.51902 8.90788 6.35837 8.59473 6.03707C8.28158 5.71577 8.125 5.32683 8.125 4.87024V3.24683C8.125 2.35057 8.44238 1.58537 9.07715 0.951219C9.71191 0.317073 10.4779 0 11.375 0H22.75C23.6471 0 24.4131 0.317073 25.0479 0.951219C25.6826 1.58537 26 2.35057 26 3.24683V22.7532C26 23.6494 25.6826 24.4146 25.0479 25.0488C24.4131 25.6829 23.6471 26 22.75 26ZM17.875 9.74049C18.3151 9.74049 18.696 9.90114 19.0176 10.2224C19.3392 10.5437 19.5 10.9242 19.5 11.3639V14.6361C19.5 15.0758 19.3392 15.4563 19.0176 15.7776C18.696 16.0989 18.3151 16.2595 17.875 16.2595H6.5V18.8215C6.5 19.0075 6.38574 19.1681 6.15723 19.3034C5.92871 19.4387 5.65788 19.4979 5.34473 19.481C5.03158 19.4641 4.7819 19.3626 4.5957 19.1766L0.457031 14.1034C0.152344 13.799 0 13.4312 0 13C0 12.5688 0.152344 12.201 0.457031 11.8966L4.5957 6.82341C4.7819 6.6374 5.03158 6.54016 5.34473 6.53171C5.65788 6.52325 5.92871 6.58667 6.15723 6.72195C6.38574 6.85724 6.5 7.02634 6.5 7.22927V9.74049H17.875Z" fill="white"/>
                            </svg>
                            <div class="information__text">Выход</div>
                        </div>
                        </Menu>
                    </div>
                </div>
            </div>
        </div>
        <Search />
        <Category v-show="category" />
    </div>
</template>
<script>
import Menu from './Menu.vue'
import Search from '../modal/Search.vue'
import Category from '../Category.vue'
import SearchWeb from '../SearchWeb.vue'
export default {
  name: 'Home',
  data: () => ({
    listOne: false,
    search: true,
    category: false,
    searchweb: ''
  }),
  methods: {
    mouseEnter () {
      this.toShowOnHover = !this.toShowOnHover
    },
    mouseLeave () {
      this.toShowOnHover = !this.toShowOnHover
    },
    showSearch () {
      this.$modal.show('Modal-Search')
    },
    categoryToggle () {
      this.category = !this.category
      this.searchWeb = ''
    },
    closeAll () {
      this.searchWeb = ''
    },
    closeCategory () {
      this.category = false
    }
  },
  components: {
    Menu,
    Search,
    Category,
    SearchWeb
  }
}
</script>
<style scoped>
    .navbar__back {
        background: linear-gradient(270.08deg, #003AA8 0.04%, #022C7F 47.91%, #051E53 99.93%);
    }
    .margin__hover {
        margin-top: 10px;
    }
    .navbar__text a {
        font-size: 14px;
        line-height: 25px;
        color: #D9D9D9;
    }
    .navbar__text a img{
        margin-right: 5px;
    }
    .search__input{
        border-radius: 8px;
        position: relative;
    }
    .search__input input {
        background: rgba(255, 255, 255, 0.15);
        border-radius: 8px;
        border: 1px solid #fff;
    }
    .search__input input:focus {
        outline: none !important;
        background: #FFF !important;
    }
    .navbar__icons {
        display: flex;
        flex-direction: row;
        justify-content: space-between;
        padding-left: 40px;
    }
    .navbar__icons a span {
        font-size: 12px;
        line-height: 15px;
        color: #FFFFFF;
        margin-bottom: 17px;
    }
    .category__button button {
        border: 1px solid #D9D9D9;
        box-sizing: border-box;
        border-radius: 8px;
        padding: 8px 10px;
        font-size: 16px;
        line-height: 16px;
        color: #FFFFFF;
    }
    .navbar__logo {
        font-size: 20px;
        color: #ffffff;
        padding: 0;
    }
    .count__navbar1 {
        position: absolute;
        margin-left: 40px;
        margin-top: -8px;
        width: 20px;
        height: 20px;
        padding-top: 3px;
        text-align: center;
        border-radius: 50%;
        background: #FC7D00;
    }
    .count__navbar2 {
        position: absolute;
        margin-top: -8px;
        margin-left: 30px;
        width: 20px;
        height: 20px;
        padding-top: 3px;
        text-align: center;
        border-radius: 50%;
        background: #FC7D00;
    }
    .login__hover {
        position: absolute;
        right: 0;
    }
    .profile__dropdown {
        position: absolute;
        background: #ffffff;
        z-index: 9999;
        margin-top: 60px;
        margin-left: -160px;
    }
    .profile__header {
        display: flex;
        flex-direction: row;
        background: linear-gradient(270.08deg, #074BCE 0.04%, #022C7F 47.91%, #00329D 99.93%);
        padding: 10px 15px 10px 15px;
    }
    .profile__title {
        font-weight: normal;
        font-size: 14px;
        line-height: 17px;
        color: #D9D9D9;
        display: flex;
        align-items: center;
        margin-left: 10px;
    }
    .profile__bottom {
        position: relative;
        padding: 15px 15px;
        z-index: 9999;
    }
    .profile__ul {
        padding-left: 5px;
    }
    .profile__item {
        margin-top: 5px;
    }
    .profile__item a {
        font-weight: 500;
        font-size: 14px;
        line-height: 17px;
        color: #565656;
    }
    .profile__item a:hover {
        color: #274784;
    }
    .profile__item a i {
        margin-right: 5px;
    }
    .hover__circle {
        position: absolute;
        width: 60px;
        height: 20px;
        background: #F8F8F8;
        border-radius: 50%;
        left: 0;
        right: 0;
        margin: -50px auto 0 auto;
        z-index: 0;
    }
    .menu__mobile{
        display: none;
    }
    .menu__responsive {
        display: none;
    }
    .navbar__logo {
        height: 40px;
    }

    @media (min-width: 769px) and (max-width: 1025px){
        .navbar__icons{
            padding-left: 0;
        }
        .category__button.ml-12{
            margin-left: 1.5rem;
        }
    }

    @media (max-width: 769px){
        .navbar__icons a{
            display: none !important;
        }
        .navbar__category{
            display: none !important;
        }
        .grid.grid-cols-7.gap-4.mt-3.pb-5 .col-span-3{
            display: none !important;
        }
        .navbar__icons{
            padding-left: 0;
            justify-content: end;
            padding-right: 65px;
        }
        .flex.navbar__text:first-child{
            display: none !important;
        }
        .grid.grid-cols-7.gap-4.mt-3{
            display: none !important;
        }
        .flex.navbar__text:last-child a:first-child{
            display: none !important;
        }
        .flex.navbar__text .ml-4{
            display: none !important;
        }
        .grid.grid-cols-7.gap-4.mt-3.pb-5{
            display: none !important;
        }
        .navbar__back .container{
            position: relative !important;
        }
        .flex.justify-between.py-2{
            position: absolute;
            padding: 0;
            right: 50px;
            top: 20px;
        }
        .menu__mobile .fa.fa-bars{
            display: block;
            color: #FFF;
            font-size: 28px;
        }
        .menu__mobile{
            display: flex;
            align-items: center;
            justify-content: space-between;
        }
        .menu__mobile .navbar__menu{
            display: flex;
            align-items: center;
        }
        .menu__mobile .navbar__menu .fa.fa-bars{
            margin-left: 1rem;
        }
        .menu__mobile .navbar__menu svg:first-child{
            fill: #FFF;
            margin-right: 1rem;
        }
        .menu__mobile .navbar__menu svg:nth-child(2){
            fill: #FFF;
            margin-right: 50px;
        }
        .menu__mobile .menu__logo svg{
            fill: #FFF;
        }
        .menu__responsive {
            display: block;
        }
        .md\:mt-3{
            margin-top: 0 !important;
        }
        .menu__responsive{
            width: 0 !important;
        }
        .navbar__back{
            position: relative !important;
        }
        .grid.grid-cols-7.gap-4.mt-0 .col-span-3{
            display: none;
        }
        .responsive__logo{
            padding-left: 0 !important;
        }
        .responsive__logo svg{
            margin: auto !important;
        }
        .menu__responsive .user__name{
            background: linear-gradient(92.64deg, #B9D5FD -2.68%, #08235C -2.67%, #377AF9 86.59%, #2267C7 99.79%);
        }
        .menu__responsive .profile__title{
            font-size: 13px;
            margin-left: 0;
        }
        .pb-1.pt-4{
            color: #D1D1D1;
        }
        .menu__responsive .my__profile{
            display: flex;
            align-items: center;
        }
        .menu__responsive .goods{
            display: flex;
            align-items: center;
        }
        .menu__responsive .management{
            display: flex;
            align-items: center;
        }
        .menu__responsive .arrow-right{
            margin-left: 15px;
            width: 16px;
            height: 16px;
            align-self: center;
        }
    }

    @media (min-width: 415px) and (max-width: 600px){
        .fa.fa-bars.navbar__menu{
            font-size: 28px;
            top: 18px;
            left: 1rem;
        }
        .flex.justify-between.py-2{
            right: 1rem;
        }
        .navbar__icons{
            padding-right: 10px;
        }
    }

    @media (max-width: 415px){
        .fa.fa-bars.navbar__menu{
            font-size: 28px;
            top: 18px;
            left: 20px;
        }
        .flex.justify-between.py-2{
            right: 20px;
        }
        .navbar__icons{
            padding-right: 40px;
        }
        .menu__responsive .arrow-right{
            margin-left: auto;
        }
    }

    @media (max-width: 376px){
        .fa.fa-bars.navbar__menu{
            font-size: 28px;
            top: 18px;
            left: 15px;
        }
        .flex.justify-between.py-2{
            right: 15px;
        }
        .navbar__icons{
            padding-right: 40px;
        }
    }
    .fade-enter-active, .fade-leave-active {
        transition: opacity .5s;
    }
    .fade-enter, .fade-leave-to /* .fade-leave-active below version 2.1.8 */ {
        opacity: 0;
    }
</style>
